#### AlphanumericRevisionSettings Members

---

|  |
| --- |
| AlphanumericRevisionSettings Class   Constructors   Methods   Properties   See Also |

The  AlphanumericRevisionSettings  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | AlphanumericRevisionSettings | Constructs an AlphanumericRevisionSettings with a simple, default sequence. |
| Public method | AlphanumericRevisionSettings(AlphanumericRevisionSettings) | Constructs a new copy of the input AlphanumericRevisionSettings object. |
| Public method | AlphanumericRevisionSettings(IList String , String, String) | Constructs an AlphanumericRevisionSettings object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  AlphanumericRevisionSettings |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetSequence | Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsEqual | Determines whether a specified AlphanumericRevisionSettings is the same as 'this'. |
| Public method | IsValid | Determines whether the AlphanumericRevisionSettings object is in a valid state. |
| Public method | SetSequence | Sets the sequence of strings to be used as numbers for revisions with the Alphanumeric RevisionNumberType. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Prefix | The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType. |
| Public property | Suffix | The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType. |

# See Also

AlphanumericRevisionSettings Class

Autodesk.Revit.DB Namespace